tutorials/multiphase/MPPICInterFoam/twoPhasePachuka/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;












































   //square section

 //vertical in the lower cylinder
 //vertical in the upper cylindre
   //square section to perimeter
   //center
  //external


vertices
(
    ( -12.8339880900537 -12.833988067018  0.0)
    (  12.8339880900537 -12.833988067018  0.0)
    (  12.8339880900537  12.833988067018  0.0)
    ( -12.8339880900537  12.833988067018  0.0)

    ( -12.8339880900537 -12.833988067018  66)
    (  12.8339880900537 -12.833988067018  66)
    (  12.8339880900537  12.833988067018  66)
    ( -12.8339880900537  12.833988067018  66)

    ( 25.6679761801074 -25.667976134036  0.0)
    ( 25.6679761801074  25.667976134036  0.0)
    ( 25.6679761801074 -25.667976134036  66)
    ( 25.6679761801074  25.667976134036  66)

    ( -25.6679761801074 -25.667976134036  0.0)
    ( -25.6679761801074  25.667976134036  0.0)
    ( -25.6679761801074 -25.667976134036  66)
    ( -25.6679761801074  25.667976134036  66)

    ( 27.2236111001139 -27.2236110512503  0.0)   //16
    ( 27.2236111001139  27.2236110512503  0.0)
    ( 27.2236111001139 -27.2236110512503  66)
    ( 27.2236111001139  27.2236110512503  66)

    ( -27.2236111001139 -27.2236110512503  0.0)
    ( -27.2236111001139  27.2236110512503  0.0)
    ( -27.2236111001139 -27.2236110512503  66)
    ( -27.2236111001139  27.2236110512503  66)

    ( 58.336309500244 -58.3363093955363  0.0) //24
    ( 58.336309500244  58.3363093955363  0.0)
    ( 58.336309500244 -58.3363093955363  66)
    ( 58.336309500244  58.3363093955363  66)

    ( -58.336309500244 -58.3363093955363  0.0)
    ( -58.336309500244  58.3363093955363  0.0)
    ( -58.336309500244 -58.3363093955363  66)
    ( -58.336309500244  58.3363093955363  66)

    ( 77.7817460003253 -77.7817458607151  0.0) //32
    ( 77.7817460003253  77.7817458607151  0.0)
    ( 77.7817460003253 -77.7817458607151  66)
    ( 77.7817460003253  77.7817458607151  66)

    ( -77.7817460003253 -77.7817458607151  0.0)
    ( -77.7817460003253  77.7817458607151  0.0)
    ( -77.7817460003253 -77.7817458607151  66)
    ( -77.7817460003253  77.7817458607151  66)

    ( 58.336309500244 -58.3363093955363  313.5) //40
    ( 58.336309500244  58.3363093955363  313.5)
    ( -58.336309500244 -58.3363093955363  313.5)
    ( -58.336309500244  58.3363093955363  313.5)

    ( 77.7817460003253 -77.7817458607151  313.5) //44
    ( 77.7817460003253  77.7817458607151  313.5)
    ( -77.7817460003253 -77.7817458607151  313.5)
    ( -77.7817460003253  77.7817458607151  313.5)

    ( 27.2236111001139 -27.2236110512503  313.5) //48
    ( 27.2236111001139  27.2236110512503  313.5)
    ( -27.2236111001139 -27.2236110512503  313.5)
    ( -27.2236111001139  27.2236110512503  313.5)

    ( -12.8339880900537 -12.833988067018  313.5) //52
    (  12.8339880900537 -12.833988067018  313.5)
    (  12.8339880900537  12.833988067018  313.5)
    ( -12.8339880900537  12.833988067018  313.5)

    ( 25.6679761801074 -25.667976134036  313.5) //56
    ( 25.6679761801074  25.667976134036  313.5)
    ( -25.6679761801074 -25.667976134036  313.5)
    ( -25.6679761801074  25.667976134036  313.5)

    ( -12.8339880900537 -12.833988067018  561) //60
    (  12.8339880900537 -12.833988067018  561)
    (  12.8339880900537  12.833988067018  561)
    ( -12.8339880900537  12.833988067018  561)

    ( 25.6679761801074 -25.667976134036  561) //64
    ( 25.6679761801074  25.667976134036  561)
    ( -25.6679761801074 -25.667976134036  561)
    ( -25.6679761801074  25.667976134036  561)

    ( 58.336309500244 -58.3363093955363  561) //68
    ( 58.336309500244  58.3363093955363  561)
    ( -58.336309500244 -58.3363093955363  561)
    ( -58.336309500244  58.3363093955363  561)

    ( 27.2236111001139 -27.2236110512503  561) //72
    ( 27.2236111001139  27.2236110512503  561)
    ( -27.2236111001139 -27.2236110512503  561)
    ( -27.2236111001139  27.2236110512503  561)

    ( 77.7817460003253 -77.7817458607151  561) //76
    ( 77.7817460003253  77.7817458607151  561)
    ( -77.7817460003253 -77.7817458607151  561)
    ( -77.7817460003253  77.7817458607151  561)

    ( -12.8339880900537 -12.833988067018  660) //80
    (  12.8339880900537 -12.833988067018  660)
    (  12.8339880900537  12.833988067018  660)
    ( -12.8339880900537  12.833988067018  660)

    ( 25.6679761801074 -25.667976134036  660) //84
    ( 25.6679761801074  25.667976134036  660)
    ( -25.6679761801074 -25.667976134036  660)
    ( -25.6679761801074  25.667976134036  660)

    ( 58.336309500244 -58.3363093955363  660) //88
    ( 58.336309500244  58.3363093955363  660)
    ( -58.336309500244 -58.3363093955363  660)
    ( -58.336309500244  58.3363093955363  660)

    ( 27.2236111001139 -27.2236110512503  660) //92
    ( 27.2236111001139  27.2236110512503  660)
    ( -27.2236111001139 -27.2236110512503  660)
    ( -27.2236111001139  27.2236110512503  660)

    ( 77.7817460003253 -77.7817458607151  660) //96
    ( 77.7817460003253  77.7817458607151  660)
    ( -77.7817460003253 -77.7817458607151  660)
    ( -77.7817460003253  77.7817458607151  660)
);

blocks
(
    hex
    (
        0 1 2 3
        4 5 6 7
    )
    (7 7 5)
    simpleGrading (1 1 1)

    //quartier est
    hex
    (
        1 8 9 2
        5 10 11 6
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //quartier ouest
    hex
    (
        3 13 12 0
        7 15 14 4
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //quartier sud
    hex
    (
        0 12 8 1
        4 14 10 5
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //quartier nord
    hex
    (
        2 9  13 3
        6 11 15 7
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

// **************************************

// Fabrication couronne inférieure 4 et 5

    //ceinture est
    hex
    (
        8 16 17 9
        10 18 19 11
    )
    (1 7 5)
    simpleGrading (1 1 1)

    //ceinture ouest
    hex
    (
        13 21 20 12
        15 23 22 14
    )
    (1 7 5)
    simpleGrading (1 1 1)

    //ceinture sud
    hex
    (
        12 20 16 8
        14 22 18 10
    )
    (1 7 5)
    simpleGrading (1 1 1)

    //ceinture nord
    hex
    (
        9  17 21 13
        11 19 23 15
    )
    (1 7 5)
    simpleGrading (1 1 1)


// Couronne inférieure externe
    //mi-couronne est
    hex
    (
        16 24 25 17
        18 26 27 19
    )
    (8 7 5)
    simpleGrading (1.1 1 1)

    //mi-couronne ouest
    hex
    (
        21 29 28 20
        23 31 30 22
    )
    (8 7 5)
    simpleGrading (1.1 1 1)

    //mi-couronne sud
    hex
    (
        20 28 24 16
        22 30 26 18
    )
    (8 7 5)
    simpleGrading (1.1 1 1)

    //mi-couronne nord
    hex
    (
        17 25 29 21
        19 27 31 23
    )
    (8 7 5)
    simpleGrading (1.1 1 1)

    //mi-couronne est2
    hex
    (
        24 32 33 25
        26 34 35 27
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //mi-couronne ouest2
    hex
    (
        29 37 36 28
        31 39 38 30
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //mi-couronne sud2
    hex
    (
        28 36 32 24
        30 38 34 26
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

    //mi-couronne nord2
    hex
    (
        25 33 37 29
        27 35 39 31
    )
    (8 7 5)
    simpleGrading (0.9 1 1)

// LongBas

    //est
    hex
    (
        18 26 27 19
        48 40 41 49
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //ouest
    hex
    (
        23 31 30 22
        51 43 42 50
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //sud
    hex
    (
        22 30 26 18
        50 42 40 48
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //Nord
    hex
    (
        19 27 31 23
        49 41 43 51
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //square
    hex
    (
        4  5  6  7
        52 53 54 55
    )
    (7 7 25)
    simpleGrading (1 1 1)

    // est-in
    hex
    (
        5  10 11 6
        53 56 57 54
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // ouest-in
    hex
    (
        7  15 14 4
        55 59 58 52
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // sud-in
    hex
    (
        4  14 10 5
        52 58 56 53
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // nord-in
    hex
    (
        6  11 15 7
        54 57 59 55
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

// Couronne exterieure longue

    // est
    hex
    (
        26 34 35 27
        40 44 45 41
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // ouest
    hex
    (
        31 39 38 30
        43 47 46 42
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // sud
    hex
    (
        30 38 34 26
        42 46 44 40
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // nord
    hex
    (
        27 35 39 31
        41 45 47 43
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

// longHaut

    //square
    hex
    (
        52 53 54 55
        60 61 62 63
    )
    (7 7 25)
    simpleGrading (1 1 1)

    // est-in
    hex
    (
        53 56 57 54
        61 64 65 62
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // ouest-in
    hex
    (
        55 59 58 52
        63 67 66 60
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // sud-in
    hex
    (
        52 58 56 53
        60 66 64 61
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // nord-in
    hex
    (
        54 57 59 55
        62 65 67 63
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    //est
    hex
    (
        48 40 41 49
        72 68 69 73
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //ouest
    hex
    (
        51 43 42 50
        75 71 70 74
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //sud
    hex
    (
        50 42 40 48
        74 70 68 72
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

    //Nord
    hex
    (
        49 41 43 51
        73 69 71 75
    )
    (8 7 25)
    simpleGrading (1.1 1 1)

// couronne externe haute

    // est
    hex
    (
        40 44 45 41
        68 76 77 69
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // ouest
    hex
    (
        43 47 46 42
        71 79 78 70
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // sud
    hex
    (
        42 46 44 40
        70 78 76 68
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

    // nord
    hex
    (
        41 45 47 43
        69 77 79 71
    )
    (8 7 25)
    simpleGrading (0.9 1 1)

// Bloc supérieur

    //square
    hex
    (
        60 61 62 63
        80 81 82 83
    )
    (7 7 10)
    simpleGrading (1 1 1)

    // est-in
    hex
    (
        61 64 65 62
        81 84 85 82
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // ouest-in
    hex
    (
        63 67 66 60
        83 87 86 80
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // sud-in
    hex
    (
        60 66 64 61
        80 86 84 81
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // nord-in
    hex
    (
        62 65 67 63
        82 85 87 83
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

// Fabrication couronne supérieure 6 et 7

    //ceinture est
    hex
    (
        64 72 73 65
        84 92 93 85
    )
    (1 7 10)
    simpleGrading (1 1 1)

    //ceinture ouest
    hex
    (
        67 75 74 66
        87 95 94 86
    )
    (1 7 10)
    simpleGrading (1 1 1)

    //ceinture sud
    hex
    (
        66 74 72 64
        86 94 92 84
    )
    (1 7 10)
    simpleGrading (1 1 1)

    //ceinture nord
    hex
    (
        65 73 75 67
        85 93 95 87
    )
    (1 7 10)
    simpleGrading (1 1 1)

    //est
    hex
    (
        72 68 69 73
        92 88 89 93
    )
    (8 7 10)
    simpleGrading (1.1 1 1)

    //ouest
    hex
    (
        75 71 70 74
        95 91 90 94
    )
    (8 7 10)
    simpleGrading (1.1 1 1)

    //sud
    hex
    (
        74 70 68 72
        94 90 88 92
    )
    (8 7 10)
    simpleGrading (1.1 1 1)

    //Nord
    hex
    (
        73 69 71 75
        93 89 91 95
    )
    (8 7 10)
    simpleGrading (1.1 1 1)

// couronne externe

    // est
    hex
    (
        68 76 77 69
        88 96 97 89
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // ouest
    hex
    (
        71 79 78 70
        91 99 98 90
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // sud
    hex
    (
        70 78 76 68
        90 98 96 88
    )
    (8 7 10)
    simpleGrading (0.9 1 1)

    // nord
    hex
    (
        69 77 79 71
        89 97 99 91
    )
    (8 7 10)
    simpleGrading (0.9 1 1)
);

edges
(
    arc 8 9 (36.3 0.0 0.0)
    arc 10 11 (36.3 0.0 66)

    arc 13 12 (-36.3 0.0 0.0)
    arc 15 14 (-36.3 0.0 66)

    arc 12 8  (0.0 -36.3 0.0)
    arc 14 10 (0.0 -36.3 66)

    arc 9  13 (0.0 36.3 0.0)
    arc 11 15 (0.0 36.3 66)

    arc 16 17 (38.5 0.0 0.0)
    arc 18 19 (38.5 0.0 66)

    arc 21 20 (-38.5 0.0 0.0)
    arc 23 22 (-38.5 0.0 66)

    arc 20 16  (0.0 -38.5 0.0)
    arc 22 18 (0.0 -38.5 66)

    arc 17 21 (0.0 38.5 0.0)
    arc 19 23 (0.0 38.5 66)

    arc 24 25 (82.5 0.0 0.0)
    arc 26 27 (82.5 0.0 66)

    arc 28 29 (-82.5 0.0 0.0)
    arc 30 31 (-82.5 0.0 66)

    arc 28 24  (0.0 -82.5 0.0)
    arc 30 26 (0.0 -82.5 66)

    arc 25 29 (0.0 82.5 0.0)
    arc 27 31 (0.0 82.5 66)

    arc 32 33 (110 0.0 0.0)
    arc 34 35 (110 0.0 66)

    arc 37 36 (-110 0.0 0.0)
    arc 39 38 (-110 0.0 66)

    arc 36 32  (0.0 -110 0.0)
    arc 38 34 (0.0 -110 66)

    arc 33 37 (0.0 110 0.0)
    arc 35 39 (0.0 110 66)

    arc 48 49 (38.5 0.0 313.5)
    arc 40 41 (82.5 0.0 313.5)

    arc 51 50 (-38.5 0.0 313.5)
    arc 43 42 (-82.5 0.0 313.5)

    arc 42 40 (0.0 -82.5 313.5)
    arc 50 48 (0.0 -38.5 313.5)

    arc 41 43 (0.0 82.5 313.5)
    arc 49 51 (0.0 38.5 313.5)

    arc 56 57 (36.3 0.0 313.5)
    arc 58 59 (-36.3 0.0 313.5)

    arc 58 56 (0.0 -36.3 313.5)
    arc 57 59 (0.0 36.3 313.5)

    arc 44 45 (110 0.0 313.5)
    arc 46 47 (-110 0.0 313.5)

    arc 46 44 (0.0 -110 313.5)
    arc 45 47 (0.0 110 313.5)

    arc 64 65 (36.3 0.0 561)
    arc 67 66 (-36.3 0.0 561)

    arc 64 66 (0.0 -36.3 561)
    arc 65 67 (0.0 36.3 561)

    arc 72 73 (38.5 0.0 561)
    arc 68 69 (82.5 0.0 561)

    arc 70 71 (-82.5 0.0 561)
    arc 74 75 (-38.5 0.0 561)

    arc 72 74 (0.0 -38.5 561)
    arc 68 70 (0.0 -82.5 561)

    arc 73 75 (0.0 38.5 561)
    arc 69 71 (0.0 82.5 561)

    arc 68 69 (82.5 0.0 561)
    arc 76 77 (110 0.0 561)

    arc 78 79 (-110 0.0 561)
    arc 76 78 (0.0 -110 561)

    arc 77 79 (0.0 110 561)
    arc 84 85 (36.3 0.0 660)

    arc 86 87 (-36.3 0.0 660)
    arc 84 86 (0.0 -36.3 660)

    arc 85 87 (0.0 36.3 660)
    arc 92 93 (38.5 0.0 660)

    arc 94 95 (-38.5 0.0 660)
    arc 94 92 (0.0 -38.5 660)

    arc 93 95 (0.0 38.5 660)
    arc 88 89 (82.5 0.0 660)

    arc 90 91 (-82.5 0.0 660)
    arc 88 90 (0.0 -82.5 660)

    arc 89 91 (0.0 82.5 660)
    arc 96 97 (110 0.0 660)

    arc 98 99 (-110 0.0 660)
    arc 98 96 (0.0 -110 660)

    arc 97 99 (0.0 110 660)
);


defaultPatch
{
    name    walls;
    type    wall;
}

boundary
(
    base
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 8 9 2)
            (2 9 13 3)
            (3 13 12 0)
            (0 12 8 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (80 81 82 83)
            (81 84 85 82)
            (83 87 86 80)
            (80 86 84 81)
            (82 85 87 83)

            (84 92 93 85)
            (87 95 94 86)
            (86 94 92 84)
            (85 93 95 87)

            (92 88 89 93)
            (95 91 90 94)
            (94 90 88 92)
            (93 89 91 95)

            (88 96 97 89)
            (91 99 98 90)
            (90 98 96 88)
            (89 97 99 91)
        );
    }
);
